public/opensource.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-26 Sun 17:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zotherstupidguy" />

<link href= "css/stylesheet.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="outline-container-org4d492a9" class="outline-2">
<h2 id="org4d492a9"><span class="section-number-2">1</span> hackerrank api for my "emacsContest.el"</h2>
<div class="outline-text-2" id="text-1">
<p>
I want to create <b>emacsContest.el</b> to holdplace to where programmers can contribute to the API integration of CP websites.
<a href="https://www.hackerrank.com/api/docs">https://www.hackerrank.com/api/docs</a> provides an api that I want to use when a contest starts to:
</p>
<ul class="org-ul">
<li>get a list of all the problems of the contest</li>
<li>parse and map the statment, constraints, input, ouput, and sample data into an org-capture template that i will store into my blog.</li>
<li>submit my sourcecode(C or Ruby) via the api via an emacs shortcut.</li>
<li>show a buffer with all status of who solved the problem and the percentage of it.</li>
</ul>
</div>
</div>


<div id="outline-container-org298241e" class="outline-2">
<h2 id="org298241e"><span class="section-number-2">2</span> Gitlapse&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ruby">ruby</span>&#xa0;<span class="startup">startup</span>&#xa0;<span class="opensource">opensource</span>&#xa0;<span class="git">git</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Improvments 
<ul class="org-ul">
<li>Use ElDoc-mode in emacs to identify what is going on while writing the code, and then text-to-speech the output of ElDoc mode and create a video out of it.</li>
<li>Create a Gitlapse-mode for doing all my stuff?? maybe not a great idea. But wasamasa can help and tehn Emacsers can do this gitlapse thing on their own machines.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga88634b" class="outline-2">
<h2 id="orga88634b"><span class="section-number-2">3</span> Mushin&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ruby">ruby</span>&#xa0;<span class="opensource">opensource</span>&#xa0;<span class="ddd">ddd</span></span></h2>
</div>

<div id="outline-container-orgcc5ff1e" class="outline-2">
<h2 id="orgcc5ff1e"><span class="section-number-2">4</span> Utter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ruby">ruby</span></span></h2>
<div class="outline-text-2" id="text-4">
<p>
**autonmous :ruby:
What are Microservices? they are hexagons
Hexagonal architecture (paper introduced by whom?)
independent processes communicate over APIs high degree of autonomy- take one ser
small, focused on doing one thing well, unix philosphy
microservices is just an opinonated way of SOA.
small autonomous services that work together, independant processes communicating over APIs, focused on one thing and doing one thing well.
Better alignment with the organizsation.
exaptation
Any organization that designs a system (defined broadly) will produce a design whose structure is a copy of the organization’s communication structure.
Monolith application
target security concern enalbe segregation models
Adopt a balanced portfolio of risk around technology.
not locked into a single programming idiom
Principles of MicroServices
Modelled around business domain
Culture of Automation
Hide Implementation details
Decentralise all the things
Deploy independently
Consumer first
Modeling around Business Domain
Presentation - Business Logic - Data Access
</p>
</div>
</div>

<div id="outline-container-org8508ac5" class="outline-2">
<h2 id="org8508ac5"><span class="section-number-2">5</span> SSD</h2>
</div>


<div id="outline-container-orgcc3a406" class="outline-2">
<h2 id="orgcc3a406"><span class="section-number-2">6</span> Hackspree</h2>
<div class="outline-text-2" id="text-6">
<p>
hackspree.com is a search engine for competitive programmers. problems, solutions, study logs, science needed.
</p>

<p>
Hackspree is a competitive programming search engine.
Hackspree is a competitive programming problems and solutions search engine.
Hackspree is a search engine for competitive programming problems and solutions.
Hackspree is a meta competitive programming solutions.
Hackspree is a metasearch engine for competitive programming problems.
Hackspree interface is elgant (similar but simpler than hackerrank). 
Hackspree provides an API for finding a problem based on scraping data.
Hackspree scrapes popular websites and displays the problem related to it nicely, it even provides relevant links to popular tags.    
It uses gitlapse api to display contestants submissions, and allows the user to display as many as they like from them.
Hackspree provides ads to make revenue.
</p>
</div>

<div id="outline-container-org4968371" class="outline-3">
<h3 id="org4968371"><span class="section-number-3">6.1</span> Finding information by crawling</h3>
</div>


<div id="outline-container-org8f14584" class="outline-3">
<h3 id="org8f14584"><span class="section-number-3">6.2</span> Organizing information by indexing</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>Index design factors:
<ul class="org-ul">
<li>Merge Factors</li>
<li>Storage Techniques</li>
<li>Index size</li>
<li>Lookup speed</li>
<li>Maintenance</li>
<li>Fault Tolerance</li>
</ul></li>
<li>Index Data Structures 
<ul class="org-ul">
<li></li>
</ul></li>
<li>References    
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Search_engine_indexing">https://en.wikipedia.org/wiki/Search_engine_indexing</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org286f05d" class="outline-3">
<h3 id="org286f05d"><span class="section-number-3">6.3</span> Descion Trees</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Store every tag of an algorithm and invert index its problem statment to find keywords that have high occarunce to the</li>
</ul>
<p>
choice of the algorithm(s) used in the solutions, then via Descion Trees predict what a given problem would require to 
be solved? 
</p>
</div>
</div>

<div id="outline-container-orgbc003b2" class="outline-3">
<h3 id="orgbc003b2"><span class="section-number-3">6.4</span> Build a search engine</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>find data (crawler) units 1-3</li>
<li>build an index units 4-5</li>
<li>rank pages unit 6; in my case should be node rank(node weight) as its a graph not nodes</li>

<li>pick a righ corpse of data, for our purposes that competitive programming</li>

<li>extracting first link (seed page)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zotherstupidguy</p>
<p class="date">Created: 2017-02-26 Sun 17:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
